black-fu/app/controllers/companies_controller.rb

INSERT INTO "companies" ("name", "ceo", "logo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "味全食品"], ["ceo", "蘇守斌"], ["logo", "weichuan-cis.png"], ["created_at", "2016-01-17 07:04:03.722794"], ["updated_at", "2016-01-17 07:04:03.722794"]]
---
  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save