black-fu/app/controllers/news_controller.rb

SELECT "news".* FROM "news"  ORDER BY postdate DESC
---
  def index
    @news = News.all

INSERT INTO "news" ("title", "content", "nimg", "postdate", "from", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @news = News.new(news_params)

    respond_to do |format|
      if @news.save

UPDATE "news" SET "nimg" = ?, "updated_at" = ? WHERE "news"."id" = ?  [["nimg", "news1.jpg"], ["updated_at", "2016-01-17 07:33:39.458219"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @news.update(news_params)

DELETE FROM "news" WHERE "news"."id" = ?  [["id", 1]]
---
  def destroy
    @news.destroy

SELECT  "news".* FROM "news" WHERE "news"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_news
      @news = News.find(params[:id])